Revit.Elements.Space.InternalRevitElement
Internal reference to the Revit Element

Revit.Elements.Space.InternalElement
Reference to the Element

Revit.Elements.Space.#ctor(Autodesk.Revit.DB.Mechanical.Space)
Create from existing element
space:

Revit.Elements.Space.#ctor(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.XYZ,System.String,System.String)
Create a new Space by Level and location
level:
location:
name:
number:

Revit.Elements.Space.InitElement(Autodesk.Revit.DB.Mechanical.Space)
Set internal element

Revit.Elements.Space.InternalSetElement(Autodesk.Revit.DB.Mechanical.Space)
Set the internal Element, ElementId, and UniqueId

Revit.Elements.Space.ByLevelLocation(Revit.Elements.Level,Autodesk.DesignScript.Geometry.Point,System.String,System.String)
Create a Revit Space Element by level and location.
level: Level the space is hosted on
location: Location for the center of the space
name: Space name
number: Space number
Returns:

Revit.Elements.Space.Name
Get the space name

Revit.Elements.Space.Number
Get the space number.

Revit.Elements.Space.Area
Get area of the space.

Revit.Elements.Space.Height
Get height of the space.

Revit.Elements.Space.Volume
Get the volume of the space.

Revit.Elements.Space.CenterBoundary
Centerline boundary of the space.

Revit.Elements.Space.CoreBoundary
Core boundary of the space.

Revit.Elements.Space.FinishBoundary
Finish boundary of the space.

Revit.Elements.Space.CoreCenterBoundary
Core center boundary of the space.

Revit.Elements.Space.Location
Get the Location of the space.

Revit.Elements.Space.IsPointInsideSpace(Autodesk.DesignScript.Geometry.Point)
Check if a point is inside of a space.

Revit.Elements.Space.SetName(System.String)
Sets the name of the space.
value: Name

Revit.Elements.Space.SetNumber(System.String)
Sets the number of the space.
value: Number